Revit 2027 API
SolidSolidCutUtils.IsAllowedForSolidCut Method
 Validates that the element is eligible for a solid-solid cut.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAllowedForSolidCut(
	Element element
)
Public Shared Function IsAllowedForSolidCut (
	element As Element
) As Boolean
public:
static bool IsAllowedForSolidCut(
	Element^ element
)
static member IsAllowedForSolidCut :
        element : Element -> bool
Parameters
element Element
 The solid to be cut or the cutting solid.
Return Value
Boolean
 True if the input element can participate in a solid-solid cut. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The element must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.
See Also
Reference
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace